<?php 
header("Content-Type:application/json");
header("Access-Contril-Allow-Orgin:*");
$topData='{
	"login": {
		"亲，请登录": "",
		"免费注册": "",
		"手机逛淘宝": ""
	},
	"my": {
		"淘宝首页": "",
		"我的淘宝": ["已买到的宝贝", "我的足迹", "我的上新", "爱逛街", "淘宝达人", "新欢"],
		"购物车": ["查看我的购物车"],
		"收藏夹": ["收藏的宝贝", "收藏的店铺"],
		"商品分类": "",
		"|": "",
		"卖家中心": ["免费开店", "已卖出的宝贝", "出售中的宝贝", "卖家服务市场", "卖家培训中心"],
		"联系客服": "",
		"网站导航": [" "]
	}
}';
$topAdSrc='{
	"loadBefore": "http://localhost:6555/image/news/head-new1.jpg",
	"loadAfter": "http://localhost:6555/image/news/head-new.jpg"
}';
$searchData='{
	"searchKey": ["一淘限时抢", "华为", "iphone", "连衣裙", "vivo", "男裤", "鱼竿", "大码女装", "男运动鞋", "aj1", "工装裤男", "秋冬连衣裙", "针织连衣裙", "篮球鞋"],
	"searchAd": "http://localhost:6555/image/news/news (1).jpg"
}';
$navData='{
	"reach": {
		"9.9疯抢": ["全场9.9", "20元封顶", "50元好货"],
		"聚划算": "",
		"淘抢购": "",
		"阿里药房": ""
	},
	"ju": "http://localhost:6555/image/ju.gif"
}';
$mainLeftNav='{
	"newsAd": {
		"new": "每日爆品1元起",
		"icon": "icon-daohang1"
	},
	"mainLeft": {
		"女人": {
			"color": "#fe6cb3",
			"chose": ["女装", "围巾", "女靴", "帽子", "睡衣", "皮草", "半身裙", "文胸", "打底裤"],
			"icon": "icon-skirt",
			"title": {
				"裙子": ["晚礼服", "连衣裙", "裙", "伴娘服", "针织连衣裙", "百褶裙", "冬半身裙", "连衣裙冬", "秀禾服", "小礼服", "拉夏贝尔", "敬酒服", "蕾丝连衣裙", "短裙", "秋冬半身裙", "夏连衣裙", "冬裙", "大码连衣裙", "连衣裙长袖", "纱裙", "长裙", "秋冬连衣裙", "年会礼服", "针织半身裙", "改良旗袍", "半身裙毛呢", "秋冬长裙", "新娘敬酒服", "格子半身裙", "半身长裙"],
				"上衣": ["面包服", "皮草", "羊羔毛", "妈妈装", "波司登", "卫衣", "羊绒大衣", "毛呢大衣", "T恤衫女", "中年女装", "妈妈棉衣", "中老年女装", "森马", "女装时尚", "妈妈冬装", "短款羽绒服", "羊剪绒", "长袖t恤女", "福袋", "长款羽绒服", "妈妈羽绒服", "妈妈毛衣", "短外套", "情侣卫衣", "羊羔毛外套", "卫衣裙", "t恤女短袖", "羊剪绒大衣", "加绒外套", "潮牌"],
				"裤子": ["打底裤", "阔腿裤", "女裤", "裤", "毛呢裤", "羽绒裤", "女外穿棉裤", "加绒牛仔裤", "加绒打底裤", "以纯", "加绒运动裤", "阔腿裤冬", "皮裤", "西装裤", "加绒牛仔裤女", "袜裤", "假两件", "毛呢短裤", "裙裤", "加厚打底裤", "短裤秋冬女", "打底外穿裤", "阔腿裤套装", "羽绒裤女外穿", "牛仔裤", "阔腿裤牛仔", "大码打底裤", "打底裤女冬", "职业装", "pull&bear"],
				"鞋子": ["女鞋", "鞋", "女靴", "高跟鞋", "拖鞋", "女运动鞋", "秋冬女鞋", "ugg", "小白鞋", "帆布鞋", "女单鞋", "女高跟鞋", "女式豆豆鞋", "女皮鞋", "老人鞋", "单鞋", "女凉鞋", "老人棉鞋", "妈妈鞋", "戎美", "new look", "白鞋", "江南布衣", "拖鞋夏", "茵曼", "anna", "人本", "凉拖鞋", "老年鞋", "妈妈棉鞋"],
				"内衣": ["情趣内衣", "袜子", "女士内裤", "保暖内衣", "文胸", "礼服", "内裤", "秋裤", "情侣睡衣", "保暖裤", "长袜", "丝袜", "南极人", "长筒袜", "加绒袜", "厚袜", "胸贴", "睡裙", "羊毛袜", "冬天睡衣", "保暖衣", "性感内裤", "潮袜", "情趣睡衣", "羊毛裤", "cos服", "加厚袜", "羊绒裤", "珊瑚绒袜", "中筒袜"],
				"配饰": ["围脖", "毛线", "手表", "发夹", "针织帽", "雷锋帽", "头绳", "发箍", "羊绒围巾", "女士手链", "毛线帽", "保暖手套", "毛线团", "潘多拉", "冬帽", "半指手套", "发簪", "皮筋", "羊绒线", "套袖", "表带", "毛领子", "冷帽", "银耳环", "珍珠发夹", "发绳", "橡皮筋", "妈妈帽", "保暖帽", "流苏耳环"]
			},
			"newAd": ["女装疯抢榜", "上衣1折起", " ", "聚划算鞋包", "内衣疯抢榜", "饰品1折起"]
		},
		"男人": {
			"color": "#3eabe6",
			"chose": ["羽绒服", "男鞋", "男棉衣", "棉衣", "男毛衣", "男装", "男裤", "男帽"],
			"icon": "icon-shangyi",
			"title": {
				"上衣": ["棉衣", "男马甲", "羊绒衫", "羊毛衫", "男T恤", "打底衫", "打底衫男", "衣服", "针织衫男", "呢大衣", "皮毛一体", "supreme", "男呢大衣", "连帽卫衣男", "背心男", "羽绒服", "hm", "真皮皮衣男", "皮衣", "supreme卫衣", "羊羔绒外套", "假两件男", "雅鹿羽绒服", "champion", "情侣装", "针织衫", "羽绒马甲", "棒球服", "皮夹克男", "aape"],
				"下装": ["男保暖裤", "睡衣男", "袜子男", "男士内裤", "工装裤男", "保暖", "运动裤", "休闲裤", "卫裤男", "男秋衣", "裤袜", "堆堆袜", "棉裤", "棉袜子", "男长裤", "秋衣", "短裤", "直筒裤男", "哈伦裤男", "束脚裤", "家居服男", "纯棉男内裤", "珊瑚绒睡衣", "保暖背心", "丁字裤男", "袜子男潮", "灯芯绒裤", "加绒背心", "加绒休闲裤", "男船袜"],
				"鞋子": ["冬季男鞋", "男靴", "马丁靴男", "运动鞋", "男休闲鞋", "皮鞋", "马丁靴", "保暖鞋男", "男高帮鞋", "短靴子", "板鞋男", "高帮男鞋", "男休闲皮鞋", "帆布鞋男", "雨鞋", "海澜之家", "骆驼男鞋", "ugg雪地靴", "gxg", "cat", "男人拖鞋", "马丁鞋男", "不干胶", "布鞋男", "马丁鞋", "冬季男棉鞋", "加绒鞋", "杰克琼斯", "男皮棉鞋", "回力男鞋"],
				"配饰": ["手套男", "男皮带", "贝雷帽子", "棒球帽", "男士手表", "腰带男", "渔夫帽", "腰带", "皮手套", "ck", "阿玛尼", "鸭舌帽男", "手套冬", "棒球帽男", "假领子", "情侣戒指", "皮带男真皮", "男生围巾", "浪琴", "男帽子潮", "对戒", "儿童手表", "dw手表", "天梭", "劳力士", "gxg男装", "背带裤", "mlb棒球帽", "贝雷帽男", "渔夫帽男"],
				"汽摩装备": ["电动车", "头盔", "摩托车", "挡风被", "男头盔", "摩托车头盔", "三轮电动车", "摩托车手套", "鬼火", "jbl", "宝马", "bose", "电动滑板车", "电动车电瓶", "挡风被冬季", "机车", "儿童头盔", "摩托", "二手车", "挡风", "电瓶车头盔", "电动轮椅", "电动车头盔", "电摩", "摩托车踏板", "电动车电池", "电动车挡风被", "冬季头盔", "汽车喇叭", "天能电池"]
			},
			"newAd": ["男装疯抢榜", "牛仔裤特卖", "男鞋疯抢榜", " ", "汽配限时抢"]
		},
		"数码": {
			"color": "#485ab6",
			"chose": ["取暖器", "华为", "电热毯", "U盘", "iphone", "耳机", "加湿器", "护膝"],
			"icon": "icon-shuma",
			"title": {
				"大家电": ["空调", "洗衣机", "热水器", "油烟机", "小厨宝", "电热水器", "小冰箱", "小米电视", "抽油烟机", "格力空调", "液晶电视", "厨宝", "燃气热水器", "苏宁易购", "海尔冰箱", "空调挂机", "32寸电视", "小型洗衣机", "美的空调", "TCL电视", "滚筒洗衣机", "小型冰箱", "海信电视", "中央空调", "洗衣机全自动", "脱水机", "冰箱家用", "迷你洗衣机", "海尔洗衣机", "格力"],
				"生活家电": ["电饭煲", "烧水壶", "微波炉", "电磁炉", "吸尘器", "双人电热毯", "热水壶", "电热水壶", "电水壶", "除螨仪", "家用加湿器", "小电饭煲", "dyson", "家用电磁炉", "家用吸尘器", "车载吸尘器", "迷你加湿器", "美的电饭煲", "usb加湿器", "小熊加湿器", "迷你电饭煲", "空气加湿器", "家电", "优惠券", "香薰加湿器", "美的电磁炉", "雾化机", "美的微波炉", "电热水瓶", "金灶"],
				"个人家电": ["剃须刀", "足浴盆", "靠垫", "护腰", "泡脚盆", "保暖护膝", "泡脚", "护腰带", "按摩枕", "洗脚盆", "体脂秤", "女护膝", "护眼仪", "背背佳", "刮刀", "按摩垫", "电子称", "脱毛仪", "自发热护膝", "剃毛器", "眼部按摩仪", "家用体重秤", "腰部按摩器", "颈托", "羊毛护膝", "足浴", "电热护膝", "刮毛器", "颈椎按摩仪", "矫正驼背"],
				"休闲家电": ["投影仪", "机箱", "mp3", "苹果7", "音箱", "无线耳机", "耳塞", "耳机头戴式", "录音笔", "投影机", "mp4", "入耳式耳机", "电视盒子", "投影", "hdmi线", "投影仪家用", "hdmi转vga", "电脑机箱", "功放机", "车载mp3", "电脑耳机", "itx机箱", "小米盒子", "小米耳机", "盒子", "索尼耳机", "beats", "电子书", "手机投影仪", "游戏耳机"],
				"电脑相机手机": ["iphone", "vivo手机", "oppo", "iphone7", "小米手机", "显示器", "显卡", "二手手机", "vivo", "笔记本电脑", "荣耀", "魅族", "mac", "OPPO手机", "CPU", "nokia", "iphone6s", "主板", "内存条", "苹果6s", "游戏", "老人机", "秒杀", "显示屏", "锤子手机", "Macbookpro", "内存", "二手显卡", "游戏本", "8g内存条"],
				"数码配件": ["ps4", "蓝牙音箱", "蓝牙音响", "路由器", "u盘32g", "车载u盘", "u盘64g", "u盘128g", "xbox", "游戏手柄", "千兆路由器", "手柄", "番茄", "ps4手柄", "蓝牙", "u盘8g", "华为耳机", "金士顿u盘", "优酷会员", "定制u盘", "ps3", "无线蓝牙耳机", "蓝牙小音箱", "xbox360", "u盘16g", "手机维修", "蓝牙接收器", "小米音响", "手机u盘", "金士顿"]
			},
			"newAd": ["数码疯抢榜", "小家电特卖", " ", " ", "数码特卖", "聚划算数码"]
		},
		"母婴": {
			"color": "#ec244b",
			"chose": ["童鞋", "棉鞋", "儿童装", "男童棉衣", "女童棉衣", "女童外套", "男童鞋"],
			"icon": "icon-muying",
			"title": {
				"童装": ["女装套装", "男童裤", "女童外套", "男童毛衣", "女童加绒裤", "女装外套", "男童加绒裤", "女童裤子", "儿童毛衣", "儿童外套", "女童卫衣", "童装男童", "女童冬外套", "儿童棉裤", "巴拉巴拉", "女童打底裤", "哈伦裤", "男童冬外套", "男童卫衣", "婴儿冬装", "儿童加绒裤", "婴儿连体衣", "棉裤女童", "牛仔外套", "男童棉裤", "儿童羽绒裤", "儿童内衣", "儿童卫衣", "童泰", "童裤"],
				"童鞋&配饰": ["儿童帽子", "男童鞋", "婴儿帽", "雪地靴儿童", "儿童围巾", "女童靴", "童鞋男童", "宝宝帽", "学步鞋", "婴儿鞋", "女童雪地靴", "女童帽", "童袜", "脖套", "婴儿袜", "帽男童", "冬女童鞋", "宝宝鞋", "宝宝手套", "男童雪地靴", "儿童靴", "女童运动鞋", "儿童围脖", "鞋袜", "宝宝袜", "女童袜", "男鞋运动鞋", "男童运动鞋", "地板袜", "女童冬靴"],
				"益智玩具": ["女孩玩具", "汽车摆件", "毛绒玩具", "玩具枪", "娃娃", "笔记本子", "乐高积木", "水弹枪", "公仔", "变形金刚", "玩偶", "高达", "巴克球", "电锯", "靠枕", "女生日礼品", "海报", "千斤顶", "弓箭", "圣诞老人", "钢铁侠", "磁力片", "小熊", "高达模型", "布娃娃", "乐高玩具", "多啦a梦", "独角兽", "女礼品", "男生礼物"],
				"奶粉辅食": ["奶粉", "益生菌", "钙片", "米粉", "羊奶粉", "爱他美", "a2奶粉", "维生素", "婴儿奶粉", "日本代购", "米粉婴儿", "美赞臣", "嘉宝", "飞鹤奶粉", "君乐宝", "羊奶", "惠氏", "hipp", "飞鹤", "德国", "嘉宝米粉", "维生素d", "合生元", "美素佳儿", "启赋", "亨氏", "奶粉进口", "雅培", "贝拉米", "婴儿益生菌"],
				"婴童用品": ["奶瓶", "纸尿裤", "婴儿推车", "婴儿睡袋", "婴儿车", "儿童睡袋", "尿不湿", "香港", "宝宝睡袋", "巴布豆", "贝亲奶瓶", "婴儿湿巾", "贝亲", "推车", "郁美净", "花王", "洗澡盆", "防踢被", "好孩子", "保温奶瓶", "婴儿洗澡盆", "帮宝适", "尿片", "婴儿浴盆", "ppsu奶瓶", "儿童面霜", "尤妮佳", "婴儿纸尿裤", "奶瓶玻璃", "湿疹"],
				"孕产必备": ["孕妇裤", "月子服", "孕妇打底裤", "孕妇毛衣", "孕妇", "孕妇睡衣", "孕妇裙", "哺乳文胸", "孕妇冬装", "防辐射服", "哺乳内衣", "孕妇内衣", "孕妇加绒裤", "孕妇连衣裙", "哺乳睡衣", "电动吸奶器", "孕妇裤冬", "孕妇牛仔裤", "孕妇背带裤", "孕妇文胸", "孕妇棉裤", "孕妇睡衣冬", "孕妇裙秋冬", "孕妇装秋冬", "宽松连衣裙", "防辐射孕妇装", "孕妇秋裤", "孕妇上衣", "美德乐", "孕妇裤秋冬"]
			},
			"newAd": ["聚划算童装", "童鞋1折起", "玩具1折起", "母婴疯抢榜", " ", "孕产特卖"]
		},
		"家居": {
			"color": "#779f24",
			"chose": ["窗帘", "暖手宝", "圣诞树", "保温杯", "口罩", "暖宝宝", "餐桌", "棉拖鞋"],
			"icon": "icon-jiaju",
			"title": {
				"整理收纳": ["收纳箱", "椅子", "晾衣架", "化妆包", "挂钩", "衣帽架", "工具箱", "整理箱", "储物箱", "粘钩", "桌面收纳", "衣架子", "无痕钉", "周转箱", "抽纸盒", "纸盒", "塑料收纳箱", "搬家纸箱", "晒衣架", "落地晾衣架", "桌面收纳盒", "化妆品收纳", "门后挂钩", "收纳包", "衣服架", "茶花", "厨房挂钩", "收纳抽屉", "儿童衣架", "化妆品收纳盒"],
				"居家日用": ["拖鞋棉", "暖水袋", "暖宝宝贴", "圣诞装饰", "毛毛鞋", "暖手袋", "热水袋充电", "圣诞节装饰", "男棉拖鞋", "圣诞节礼品", "拖鞋冬", "热水袋注水", "电暖宝", "电热水袋", "拖鞋冬男", "充电暖手宝", "充电暖宝宝", "暖足贴", "圣诞礼盒", "保暖鞋", "暖桌垫", "加热桌垫", "圣诞树套餐", "发热桌垫", "暖脚贴", "圣诞花环", "艾灸贴", "小圣诞树", "女拖鞋", "儿童棉拖鞋"],
				"清洁洗护": ["袖套", "抽纸", "纸巾", "洗衣液", "女袖套", "卷纸", "香薰", "车载香水", "纸巾抽纸", "垃圾桶家用", "檀香", "袖套女冬", "倒流香", "沉香", "维达", "餐巾纸", "纸抽", "手纸", "维达抽纸", "香薰精油", "护袖", "资生堂", "清风抽纸", "卫生纸卷纸", "香", "手袖", "清风", "防水袖套", "洗发露", "康王"],
				"厨房餐饮": ["置物架", "茶盘", "碗", "茶杯", "饭盒", "厨房置物架", "马克杯", "保温饭盒", "玻璃杯", "保温杯女", "男士保温杯", "盘子", "陶瓷杯", "星巴克", "茶台", "玻璃水杯", "膳魔师", "宜家", "托盘", "保温杯儿童", "杯子陶瓷", "厨房收纳", "杯套", "玻璃茶杯", "碗架", "保温桶", "厨房收纳架", "55度杯", "实木茶盘", "陶瓷碗"],
				"家纺家饰": ["被套", "装饰画", "墙贴", "棉拖", "棉拖鞋女", "窗帘布", "被套单件", "挂画", "贴纸", "床上用品", "地毯客厅", "窗帘成品", "壁画", "客厅装饰画", "卧室地毯", "纯棉四件套", "汽车脚垫", "画", "床上四件套", "毛拖鞋", "保暖鞋女", "毛毛拖鞋", "春节装饰", "磨毛四件套", "婚房装饰", "居家鞋", "被套纯棉", "棉拖鞋包跟", "3d立体墙贴", "婚庆用品"],
				"家具建材": ["台灯", "吸顶灯", "电脑桌", "灯具", "吊灯", "客厅灯", "壁纸", "布艺沙发", "创意礼品", "卧室灯", "led吸顶灯", "电视背景墙", "饰品", "北欧沙发", "台式电脑桌", "实木餐桌", "礼品定制", "地球仪", "欧式沙发", "沙漏", "礼品男", "客厅摆件", "茶几简约", "水晶灯", "结婚礼物", "模型", "圆桌", "餐桌椅组合", "美式沙发", "北欧茶几"]
			},
			"newAd": [" ", "百货疯抢榜", "清洁洗护特卖", "餐饮具特卖", "家居家纺特卖", "聚划算家装"]
		},
		"美食": {
			"color": "#e3751e",
			"chose": ["枸杞", "白酒", "苹果", "咖啡", "红酒", "面包", "大米", "三只松鼠", "牛排"],
			"icon": "icon-meishi",
			"title": {
				"各地特产": ["牛肉干", "牛肉", "周黑鸭", "猪肉铺", "槟榔", "湖南特产", "小鱼干", "牛板筋", "鱿鱼仔", "卤味", "猪油渣", "辣子鸡", "风干牛肉干", "鸭舌头", "猪油", "风干牛肉", "凤爪", "肉干", "鱿鱼丝", "鱿鱼干", "四川特产", "鱼干", "烧鸡", "小鱼仔", "兔肉", "猪肉干", "哈尔滨红肠", "泡椒凤爪", "肉脯", "牦牛肉干"],
				"休闲零食": ["面包", "酒", "年货", "糖", "棒棒糖", "蛋黄酥", "喜糖", "糕点", "马卡龙", "早餐食品", "茅台", "全麦面包", "麻花", "薯片", "枣", "点心", "五粮液", "啤酒", "糍粑", "白酒整箱", "汾酒", "脆枣", "紫米面包", "椰枣", "手撕面包", "爆米花", "鲜花饼", "麻薯", "姜糖", "沙琪玛"],
				"各类坚果": ["腰果", "花生", "板栗", "花生米", "干果零食", "巴旦木", "南瓜子", "纸皮核桃", "山核桃仁", "巴西松子", "吊瓜子", "西瓜子", "栗子", "薄皮核桃", "松子仁", "山核桃", "越南腰果", "瓜子仁", "酒鬼花生", "葵花籽", "小核桃仁", "甘栗仁", "恰恰瓜子", "洽洽瓜子", "小核桃", "多味花生", "杏仁片", "东北松子", "腰果炭烧", "来一份"],
				"茗茶冲饮": ["奶茶", "燕麦片", "酸奶", "花茶", "普洱茶", "早餐", "雀巢咖啡", "纯牛奶", "茉莉花茶", "燕麦", "速溶咖啡", "菊花茶", "玫瑰花茶", "奶茶粉", "普洱", "辣木籽", "菊花", "玫瑰花", "矿泉水", "蒲公英茶", "g7咖啡", "黑咖啡", "金银花", "苦荞麦茶", "安慕希", "蒲公英", "屈臣氏", "普洱茶熟茶", "卡乐比", "大麦茶"],
				"生鲜蔬果": ["橙子", "生日蛋糕", "牛排", "水果苹果", "赣南脐橙", "猕猴桃", "冰糖橙", "脐橙", "下饭菜", "萝卜干", "咸鸭蛋", "泡菜", "提拉米苏", "血橙", "榨菜", "橘子", "酸菜", "咸菜", "金桔", "辣白菜", "褚橙", "好利来", "蛇果", "韩国泡菜", "东北酸菜", "纸杯蛋糕", "冰糖心苹果", "新鲜苹果", "湖北特产", "橙"],
				"粮油米面": ["蜂蜜", "螺丝粉", "泡面", "大米", "方便面", "酸辣粉", "黑枸杞", "米", "面粉", "干脆面", "花椒", "米线", "宁夏枸杞", "牛肉酱", "热干面", "养生茶", "土蜂蜜", "汤达人", "红薯粉", "五宝茶", "粉条", "蜂巢蜜", "五常大米", "东北大米", "蜂蜜纯天然", "金戈", "整箱泡面", "粉丝", "康师傅", "低筋面粉"]
			},
			"newAd": ["美食特卖", "美食疯抢榜", " ", "冲饮1折起", "蔬果1折起", "米面1折起"]
		},
		"美妆": {
			"color": "#c64adc",
			"chose": ["口红", "洗发水", "眼影", "吹风机", "牙刷", "假发", "护手霜", "眼霜"],
			"icon": "icon-meizhuang",
			"title": {
				"基础护肤": ["眼霜", "面霜", "护肤品", "百雀羚", "大宝", "芦荟胶", "sk-ii", "祛痘", "补水面膜", "洁面仪", "水乳", "美容仪", "冻干粉", "精华液", "马油", "洗脸仪", "爽肤水", "贵妇膏", "大宝sod蜜", "契尔氏", "黛珂", "兰蔻粉水", "自然堂", "安瓶", "兰芝", "维生素e乳", "海藻面膜", "祛斑", "水密码", "睡眠面膜"],
				"精致妆容": ["唇釉", "眼影盘", "dior口红", "润唇膏", "ysl口红", "甲油胶", "粉底", "kiko口红", "chanel口红", "kiko", "3ce口红", "化妆箱", "修眉刀", "眉粉", "睫毛夹", "卸妆棉", "cpb隔离", "分装瓶", "喷雾瓶", "阿玛尼口红", "纪梵希口红", "画眉神器", "口红小样", "ysl唇釉", "粉刺针", "变色唇膏", "压缩面膜", "nyx", "兰蔻口红", "卡姿兰口红"],
				"气质香氛": ["香水女士", "男士香水", "手工皂", "ck香水", "瘦腿神器", "小样香水", "coco香水", "dior香水", "纯露", "jo malone", "毒药", "栀子花", "祖马龙香水", "精油按摩", "祛疤", "高夫", "阿芙", "马油皂", "雅芳", "香膏", "气味书籍馆", "兰蔻香水", "长高", "玫瑰精油", "古琦香水", "玫瑰纯露", "精油瓶", "羊奶皂", "安娜苏", "天竺葵"],
				"美发护发": ["染发剂", "假发女", "电风吹", "假发男", "理发器", "染发", "发胶", "阿道夫", "伪娘", "发膜", "发蜡", "护发精油", "染发膏", "家用吹风机", "假发女短发", "发泥", "一洗黑", "生姜洗发水", "吹风筒", "弹力素", "吕洗发水", "露华浓", "直发膏", "发油", "风筒", "电推剪", "箭牌", "滋源", "lush", "pola"],
				"个人护理": ["身体乳", "凡士林", "冻疮膏", "冲牙器", "瘦腿霜", "洗牙器", "甘油", "欧舒丹", "脱毛", "香体乳", "欧舒丹手霜", "泡泡浴", "凡士林手霜", "润肤乳", "资生堂手霜", "蛇油膏", "欧乐b", "儿童电动牙刷", "冻疮", "小甘菊手霜", "裂可宁", "润肤露", "脚膜", "欧姆龙", "美加净手霜", "马油手霜", "凡士林身体乳", "百雀羚手霜", "韩国手霜", "屈臣氏手霜"],
				"男士护肤": ["刮胡刀", "男唇膏", "剃须刀电动", "男士洗面奶", "男士护肤", "飞利浦", "男士面膜", "润唇膏男", "巴黎欧莱雅", "曼秀雷敦", "飞科剃须刀", "飞利浦剃须刀", "护肤品套装", "男剃须刀", "男士护肤品", "飞科", "化妆品套装", "电动刮胡刀", "男士爽肤水", "uno", "博朗剃须刀", "博朗", "松下剃须刀", "男士bb霜", "超人剃须刀", "电动剃须刀男", "男化妆品", "男护肤品套装", "胡子刀", "护肤霜"]
			},
			"newAd": ["护肤1折起", "美妆疯抢榜", "彩妆1折起", "美发1折起", " ", "男护肤特卖"]
		},
		"箱包": {
			"color": "#db8e5a",
			"chose": ["女包", "行李箱", "zara", "双肩包", "女双肩包", "钱包", "男背包"],
			"icon": "icon-xiangbao",
			"title": {
				"女包": ["女斜挎包", "zara", "女单肩包", "小ck女包", "斜挎女包", "mk 女包", "ck 女包", "毛毛包", "真皮女包", "帆布包", "coach女包", "链条包", "coach", "女手包", "小方包", "cos", "胸包", "达芙妮", "古琦", "小ck包", "女手提包", "古琦女包", "女挎包", "便当包", "布袋", "女包", "小ck", "外贸女装", "ysl女包", "歌莉娅"],
				"男包": ["男单肩包", "信封", "男斜挎包", "男挎包", "健身包", "男胸包", "公文包", "邮差包", "男公文包", "男士手提包", "挎包", "selected", "ck包", "男包单肩包", "男休闲包", "古琦包", "coach男包", "皮包", "男小包", "supreme包", "真皮男手包", "帆布单肩包", "ck男包", "男单肩斜挎包", "帆布工具包", "男背包", "男手包", "男胸包", "商务包", "休闲包"],
				"旅行包袋": ["旅行箱", "登机箱", "拉篮", "密码箱", "行李包", "行李袋", "旅行袋", "拉杆包", "儿童拉杆箱", "皮箱", "箱包", "小行李箱", "20寸拉杆箱", "24寸拉杆箱", "儿童行李箱", "拉箱", "旅行包手提", "拉杆旅行箱", "手提箱", "rimowa", "20寸行李箱", "日默瓦", "行李", "新秀丽拉杆箱", "24寸行李箱", "拉杆箱万向轮", "短途旅行包", "旅游包", "箱", "美旅拉杆箱"],
				"运动包/双肩包": ["斐乐", "旅行包", "腰包", "双肩女包", "军迷", "运动包", "户外用品", "登山包", "mcm", "男腰包", "男士双肩背包", "旅行收纳袋", "束口袋", "户外装备", "帆布双肩包", "北极狐", "行李牌", "耐克双肩包", "mcm双肩包", "tumi", "行李箱套", "书包中学生", "女小背包", "耐克书包", "coach双肩包", "大学生女书包", "运动腰包", "spao", "男手机包", "杰斯伯"],
				"功能小包": ["小钱包", "驾驶证", "手机包", "ck男钱包", "卡套公交", "驾驶证皮套", "零钱袋", "银行卡套", "coach钱包", "驾照套", "证件包", "啄木鸟", "汽车钥匙包", "双肩包女帆布", "mk钱包", "皮夹", "背包女韩版", "卡夹", "驾驶证套", "硬币包", "钱夹", "阿玛尼男钱包", "小钱包零钱包", "卡包多卡位", "手工钱包", "卡通零钱包", "真皮钱包", "卡片包", "mcm钱包", "钥匙包真皮"]
			},
			"newAd": ["女包1折起", "男包1折起", "旅行箱特卖", " ", " "]
		}
	}
}';
$carousel='{
	"carousel1": {
		"src": ["http://localhost:6555/image/carousel/lun1 (1).jpg", "http://localhost:6555/image/carousel/lun1 (2).jpg", "http://localhost:6555/image/carousel/lun1 (3).jpg", "http://localhost:6555/image/carousel/lun1 (4).jpg", "http://localhost:6555/image/carousel/lun1 (5).jpg", "http://localhost:6555/image/carousel/lun1 (6).jpg", "http://localhost:6555/image/carousel/lun1 (7).jpg", "http://localhost:6555/image/carousel/lun1 (8).jpg"]
	},
	"carousel2": {
		"src": ["http://localhost:6555/image/carousel/lun2 (1).jpg", "http://localhost:6555/image/carousel/lun2 (2).jpg", "http://localhost:6555/image/carousel/lun2 (3).jpg"],
		"title": ["抢110新春福袋！", "运动户外大牌年末清仓", "健足乐 中老年妈妈鞋"],
		"news": ["都市错峰 人少价低 抢>", "限时钜惠疯抢还有大额券", "折后再8.8折起"]
	},
	"carousel3": {
		"page1": {
			"picNew": ["一体打底裤不加绒百搭踩脚裤薄款外穿女高腰显瘦春秋七彩棉小脚裤", "10双浪莎棉袜男士薄款臭脚克星黑色纯棉防臭中筒商务袜子秋冬加厚", "2-3双 防臭运动鞋垫男女士吸汗透气除臭减震保暖运动篮球鞋垫冬季", "伊米伦男童保暖帽子秋冬宝宝针织套头帽婴儿毛线帽子冬季儿童帽子", "得力金属彩色白色油漆笔油性记号笔轮胎笔DIY金色签名高光绘画笔", "山东烟台栖霞红富士苹果5斤陕西时令新鲜水果平安果脆甜吃的苹果", "脱毛器女士剃毛器刮毛刀腋毛私处修剪器男电动剃刀仪机腿阴毛下体", "莫代尔薄款男士长袖t恤纯棉圆领修身打底衫纯色青年秋衣体恤潮"],
			"price": ["13.98", "39.50", "11.80", "19.90", "16.80", "35.90", "29.90", "12.90"],
			"oldPrice": ["¥38.00", "¥58.00", "¥20.00", "", "", "¥69.00", "¥69.00", "¥57.00"],
			"src": ["http://localhost:6555/image/carousel/lun3 (1).jpg", "http://localhost:6555/image/carousel/lun3 (2).jpg", "http://localhost:6555/image/carousel/lun3 (3).jpg", "http://localhost:6555/image/carousel/lun3 (4).jpg", "http://localhost:6555/image/carousel/lun3 (5).jpg", "http://localhost:6555/image/carousel/lun3 (6).jpg", "http://localhost:6555/image/carousel/lun3 (7).jpg", "http://localhost:6555/image/carousel/lun3 (8).jpg"]
		},
		"page2": {
			"picNew": ["纯色t恤女长袖欧美2018秋冬新款修身显瘦高领保暖紧身打底连体衣", "四条装日系女士内裤女可爱纯棉抗菌中低腰全棉白色大码少女三角裤", "职业头花发网网兜韩国工作发卡盘发饰品可爱空姐头饰护士发夹发套", "儿童棉拖鞋包跟男孩防滑软底可爱迪士尼男童拖鞋冬季小童中童保暖", "1000支吸管一次性吸管珍珠奶茶粗吸管独立包装彩色塑料果粒大吸管", "【满99减50】楼兰蜜语新疆红枣夹核桃248g夹心大枣抱抱果送女友", "原始点按摩器 柔软硅胶头按摩锥 代替人工手肘揉耳根颈腰 按摩棒", "catwick短袖打底衫男装修身t恤圆领夏季莫代尔棉半袖丝光棉简约"],
			"price": ["42.00", "35.50", "15.80", "24.80", "24.70", "39.80", "15.00", "49.90"],
			"oldPrice": ["¥199.00", "", "", "¥88.00", "¥56.70", "¥68.00", "", "¥128.00"],
			"src": ["http://localhost:6555/image/carousel/lun3 (9).jpg", "http://localhost:6555/image/carousel/lun3 (10).jpg", "http://localhost:6555/image/carousel/lun3 (11).jpg", "http://localhost:6555/image/carousel/lun3 (12).jpg", "http://localhost:6555/image/carousel/lun3 (13).jpg", "http://localhost:6555/image/carousel/lun3 (14).jpg", "http://localhost:6555/image/carousel/lun3 (15).jpg", "http://localhost:6555/image/carousel/lun3 (16).jpg"]
		},
		"page3": {
			"picNew": ["中年妈妈女裤秋冬季款高腰休闲裤直筒弹力加绒加厚秋装中老年长裤", "二条安全裤防走光女夏打底裤女薄款内穿性感蕾丝中低腰纯棉内裤女", "新款时尚韩版女士小手提包简约百搭帆布包包大容量拎袋2018女包潮", "满19减10元橡皮筋发圈成人发夹百搭头花头绳头饰韩女童发饰12个装", "tfboys王俊凯易烊千玺王源周边抱枕定制 双面DIY照片靠垫生日礼物", "18年新货【西域美农_薄皮核桃250g*2袋】新疆零食坚果核桃非纸皮", "双重纹绣密封储物罐收纳盒打雾针片色料戒指杯棉片储物盒用品工具", "冬季保暖衬衫男长袖加绒加厚韩版休闲中年潮流衬衣中老年打底衫寸"],
			"price": ["45.00", "12.90", "19.90", "19.98", "18.90", "23.99", "9.90", "49.00"],
			"oldPrice": ["¥258.00", "¥19.90", "¥49.00", "¥39.00", "", "¥58.80", "¥10.00", "¥398.00"],
			"src": ["http://localhost:6555/image/carousel/lun3 (17).jpg", "http://localhost:6555/image/carousel/lun3 (18).jpg", "http://localhost:6555/image/carousel/lun3 (19).jpg", "http://localhost:6555/image/carousel/lun3 (20).jpg", "http://localhost:6555/image/carousel/lun3 (21).jpg", "http://localhost:6555/image/carousel/lun3 (22).jpg", "http://localhost:6555/image/carousel/lun3 (23).jpg", "http://localhost:6555/image/carousel/lun3 (24).jpg"]
		},
		"page4": {
			"picNew": ["韩版婚纱挂脖式镂空礼服裙蝴蝶结高腰露背长款小礼服伴娘团姐妹裙", "本命年大红色男士背心莫代尔青年吊带跨栏弹力内衣紧身打底衫汗衫", "包包女2018秋季新款女包韩版百搭大气手提包时尚大容量单肩斜挎包", "英纷艾可魔法少女 高级魔法棒 魔法钢琴 魔法小提琴动漫玩具套装", "A4不干胶标签打印纸 固定资产标签贴撕不烂高粘性贴纸防水防油", "【旗舰店】曼乔咖啡 经典红枣咖啡 速溶咖啡低咖啡因8条*28g包邮", "艾灸盒纯铜随身灸家用宫寒无烟多部位艾灸衣艾柱艾盒艾灸条温灸器", "秋季男装修身型牛仔裤潮男百搭小脚裤青少年男裤紧身显瘦铅笔裤"],
			"price": ["42.80", "23.00", "39.99", "43.00", "14.90", "39.00", "18.00", "39.00"],
			"oldPrice": ["¥100.00", "", "¥95.22", "", "¥29.80", "¥78.00", "¥38.00", "¥188.00"],
			"src": ["http://localhost:6555/image/carousel/lun3 (25).jpg", "http://localhost:6555/image/carousel/lun3 (26).jpg", "http://localhost:6555/image/carousel/lun3 (27).jpg", "http://localhost:6555/image/carousel/lun3 (28).jpg", "http://localhost:6555/image/carousel/lun3 (29).jpg", "http://localhost:6555/image/carousel/lun3 (30).jpg", "http://localhost:6555/image/carousel/lun3 (31).jpg", "http://localhost:6555/image/carousel/lun3 (32).jpg"]
		},
		"page5": {
			"picNew": ["大码秋冬装季胖mm2018新款韩版百搭长袖卫衣条纹高领T桖女打底衫", "包邮男女均可穿*天鹅绒加厚200D超柔开D连身袜连体丝袜全包丝袜", "韩版头绳发圈发饰橡皮筋皮套扎头绳扎头发饰品长飘带发绳头饰", "儿童马甲冬天加绒加厚女童棉马甲宝宝婴幼儿保暖背心男童马夹坎肩", "檀香盘香卫生间驱虫驱蚊香家用室内熏香厕所除臭卧室香薰净化空气", "可比克薯片罐装桶装一整箱薯片大礼包组合混合装包邮膨化零食批发", "发际线填充神器美化大额头修容粉阴影粉遮盖头皮补充发量前额稀少", "冬季男士加肥加大加绒加厚保暖衬衫胖子大码正装青年肥佬长袖衬衣"],
			"price": ["42.00", "45.00", "2.80", "49.90", "15.80", "29.90", "39.90", "39.90"],
			"oldPrice": ["¥94.00", "", "¥5.80", "¥98.00", "¥31.60", "¥68.00", "", "¥99.00"],
			"src": ["http://localhost:6555/image/carousel/lun3 (33).jpg", "http://localhost:6555/image/carousel/lun3 (34).jpg", "http://localhost:6555/image/carousel/lun3 (35).jpg", "http://localhost:6555/image/carousel/lun3 (36).jpg", "http://localhost:6555/image/carousel/lun3 (37).jpg", "http://localhost:6555/image/carousel/lun3 (38).jpg", "http://localhost:6555/image/carousel/lun3 (39).jpg", "http://localhost:6555/image/carousel/lun3 (40).jpg"]
		}
	}
}';
$mainNewsAd='{
	"mainTopNewsImg": ["http://localhost:6555/image/news/news (2).jpg", "http://localhost:6555/image/news/news (5).jpg"],
	"mainTopNavImg": ["http://localhost:6555/image/main-left/main-left (1).png", "http://localhost:6555/image/main-left/main-left (2).png", "http://localhost:6555/image/main-left/main-left (3).png", "http://localhost:6555/image/main-left/main-left (4).png", "http://localhost:6555/image/main-left/main-left (5).png", "http://localhost:6555/image/main-left/main-left (6).png", "http://localhost:6555/image/main-left/main-left (7).png", "http://localhost:6555/image/main-left/main-left (8).png"],
	"mainBotmNewsad": {
		"icon": ["icon-4", "icon-shizhong"],
		"top": ["超 值 专 区", "每 日 十 点 更 新"],
		"title": ["特卖", "热卖", "活动", "活动"],
		"news": ["美赞臣88会员日 抢10万猫超卡 ", " 立减30， 大牌疯抢 ", " PUMA 夏季情侣凉拖鞋 领券折上折 ", " 生活进化论， 抢100元神券 "],
		"ad": ["http://localhost:6555/image/news/news (6).jpg"]
	},
	"mainBotNewsImg": ["http://localhost:6555/image/news/news (1).jpg", "http://localhost:6555/image/news/news (3).jpg", "http://localhost:6555/image/news/news (4).jpg"]
}';
$discountLeft='{
	"top": {
		"title": ["淘宝折扣", "低价每日抢"],
		"content": {
			"icon": ["icon-0082", "icon-baoyou", "icon-20yuanfengding", "icon-50yuanhaohuo", "icon-haiwai", "icon-remai", "icon-zhuangxiu", "icon-huiyuanzhuanxiangquan"],
			"text": ["超级返利", "9块9包邮", "20元封顶", "50元好货", "海外精选", "今日热卖", "装修9.9", "专享券"]
		}
	},
	"bottom": {
		"title": "特卖汇",
		"content": {
		"text": {
			"9.9疯抢": ["字母T恤", "小百货", "数码配件"],
			"20封顶": ["连衣裙", "蕾丝衫", "小包"],
			"50好货": ["男T恤", "polo衫", "休闲裤"],
			"服饰特卖": ["新品女装", "男装", "大牌内衣"],
			"鞋包配饰": ["女鞋", "男鞋", "热卖包包"],
			"母婴生活": ["婴用", "清洁用品", "面膜"],
			"数码运动": ["手机", "冷风扇", "冰箱"]
		}
	}
	}
}';
switch ($_GET['getData']) {
	case 'top':
		echo $topData;
		break;
	case 'topAd':
		echo $topAdSrc;
		break;
	case 'search':
		echo $searchData;
		break;
	case 'nav':
		echo $navData;
		break;
	case 'mainLeftNav':
		echo $mainLeftNav;
		break;
	case 'mainLeftLoad':
		echo $mainLeftLoad;
		break;
	case 'carsousel':
		echo $carousel;
		break;
	case 'mainnews':
		echo $mainNewsAd;
		break;
	case 'discountLeft':
		echo $discountLeft;
		break;
};